"XcodeTools_title" = "iPhone SDK";
"XcodeTools_description" = "";

"DevTools_title" = "Developer Tools Essentials";
"DevTools_description" = "Installs Xcode, Interface Builder, Instruments, Dashcode, Quartz Composer, GCC 4.0.1, GCC 4.2.1, LLVM-GCC 4.2.1, GDB, and other developer tools. Also installs the Mac OS X 10.4 (Universal) and Mac OS X 10.5 SDKs. All content is placed inside a location chosen by the user (default is /Developer on the boot volume).";

"DeveloperToolsSystemComponents_title" = "System Tools";
"DeveloperToolsSystemComponents_description" = "Installs system-wide tools such as Shark (part of the CHUD performance tools), DTrace components used by Instruments, and distributed build processes.

There can be only one, newest set of System Tools per Mac OS X installation at a time, and are always installed into /Developer on the boot volume. ";

"UNIXDevelopmentSupport_title" = "UNIX Development Support";
"UNIXDevelopmentSupport_description" = "Optional content to allow command-line development from the boot volume. Installs a duplicate of the GCC compiler and command line tools included with the core Xcode developer tools package into the boot volume. It also installs header files, libraries, and other resources for developing software using Mac OS X into the boot volume.  This package is provided for compatibility with shell scripts and makefiles that require access to the developer tools in specific system locations. This content is not relocatable and will only be installed onto the boot volume.";

"CrossDevelopmentGroup_title" = "Mac OS X 10.3.9 Support";
"CrossDevelopmentGroup_description" = "Support for developing applications that target Mac OS X 10.3.9 APIs. Includes the Apple version of the GCC 3.3 compiler and the Mac OS X 10.3.9 SDK. Note: GCC 3.3 is not relocatable and is installed on the boot volume.";

"WebObjectsGroup_title" = "WebObjects";
"WebObjectsGroup_description" = "WebObjects development tools, examples, and documentation. Note: WebObjects is not relocatable and is installed into /Developer on the boot volume.";

"iPhoneSDK_title" = "iPhone SDK";
"iPhoneSDK_description" = "Provides tools, header files, libraries, and documentation for iPhone OS application development. Installs inside the ./Platforms folder within the developer folder (default is /Developer/Platforms).  The iPhone SDK requires an Intel-based Mac running Mac OS X version 10.5.3 or later.";
"TT_NOIPHONESDK" = "You cannot install the iPhone SDK until you have agreed to the software license agreement.";
"TT_NOINTEL" = "The iPhone SDK requires an Intel-based Mac.";
"TT_NOOS" = "The iPhone SDK requires 10.5.3.";

"ERROR_OSVER" = "A version of Mac OS X 10.5 was not found.";
"BOOT_VOLUME_ERR" = "You can only install this software on the boot partition.";
"ERR_INVALID_BUILD" = "A valid version of Mac OS X was not found.";

"TT_NEWERALREADYINSTALLED" = "A newer version of this software is already installed.";
